Tekla Open API Reference for Tekla Structures 2025
ViewBase.FrameOrigin Property
 The vector from the view origin to the frame origin.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector FrameOrigin { get; set; }
Public Property FrameOrigin As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
ViewBase Class
Tekla.Structures.Drawing Namespace